; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation13 - direction
	GroundStation6 - direction
	Star14 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star12 - direction
	GroundStation9 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star12)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation8)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star16)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation10)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star0)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star5)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
)
(:goal (and
	(pointing satellite1 GroundStation9)
	(pointing satellite2 GroundStation3)
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 image1)
	(have_image Planet17 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 5
2. (turn_to satellite1 groundstation9 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 groundstation9)
   goals met: 2 of 5
3. (turn_to satellite0 groundstation11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation11)
   goals met: 2 of 5
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 5
5. (calibrate satellite0 instrument0 groundstation11)
   added: (calibrated instrument0)
   goals met: 2 of 5
6. (turn_to satellite0 phenomenon15 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 5
7. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 5
8. (turn_to satellite0 planet17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet17)
   goals met: 3 of 5
9. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 4 of 5
10. (turn_to satellite0 star16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star16)
   goals met: 4 of 5
11. (take_image satellite0 star16 instrument0 image1)
   added: (have_image star16 image1)
   goals met: 5 of 5
